app/controllers/orders_controller.rb

INSERT INTO "orders" ("name", "email", "phone", "address", "amount", "user_id", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = current_user.orders.build( order_params )
    @order.payment_method = "Credit"

    if @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT 1
INSERT INTO "payments" ("order_id", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def checkout_allpay
    @order = current_user.orders.find( params[:id] )

      @payment = Payment.create!( :order_id => @order.id,
                                  :payment_method => "Credit" )